docs/waydroidEnNixOS.html
<!DOCTYPE html>
<html lang="es">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cómo bloquear sitios web en NixOS</title>
<meta name="author" content="Juan E. Gómez-Morantes" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<header>
<h1 class="title">Cómo bloquear sitios web en NixOS</h1>
</header><p>
En esta nota mostraré cómo usar <code>waydroid</code> en sistemas operativos <code>NixOS</code>.
</p>
<div id="outline-container-orgc8d53dc" class="outline-2">
<h2 id="orgc8d53dc">¿Qué es <code>waydroid</code>?</h2>
<div class="outline-text-2" id="text-orgc8d53dc">
<p>
<a href="https://waydro.id/">Waydroid</a> es un contenedor de Android que se puede correr sobre sistemas operativos Linux. Con él, se puede tener un ambiente Android completo dentro de una máquina Linux para correr aplicaciones nativas de Android.
</p>

<p>
Como su nombre sugiere, requiere <code>wayland</code> para funcionar correctamente.
</p>
</div>
</div>
<div id="outline-container-orgec561ab" class="outline-2">
<h2 id="orgec561ab">Instalación</h2>
<div class="outline-text-2" id="text-orgec561ab">
<p>
Hay que incluir las siguientes líneas en <code>configuration.nix</code>:
</p>

<div class="org-src-container">
<pre class="src src-nix"><span style="color: #D8DEE9;">environment.systemPackages</span> = <span style="color: #81A1C1;">with</span> pkgs; [
  ...
  waydroid
  ...
];

<span style="color: #D8DEE9;">virtualisation.waydroid.enable</span>=true;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf9fd450" class="outline-2">
<h2 id="orgf9fd450">Iniciación y configuración inicial</h2>
<div class="outline-text-2" id="text-orgf9fd450">
<p>
Ya se tiene instalado <code>waydroid</code> y activado como servicio, pero ahora falta instalar una imagen de sistema operativo Android. Si se quiere un sistema vanilla, se debe correr el siguiente comando desde la terminal del sistema anfitrión:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ sudo waydroid init
</pre>
</div>

<p>
Este no tendrá ninguna aplicación de Google.
</p>

<p>
Si, por el contrario, se quiere una imagen con el ecosistema Google, se debe hacer de la siguiente manera:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ sudo waydroid init -f -s GAPPS
</pre>
</div>

<p>
Luego de esto, y de reinicializar el servicio, se corre la aplicación <code>waydroid</code> desde el lanzador del ambiente del manejador de escritorio.
</p>

<p>
Ahora tendremos que certificar el dispositivo en Google Play (si escogimos la imagen GAPPS), crear carpetas compartidas, y hacer otro tipo de configuraciones básicas. Toda esa información se encuentra en <a href="https://docs.waydro.id/">https://docs.waydro.id/</a>. 
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Fecha: 2022:08:05</p>
<p class="author">Autor: Juan E. Gómez-Morantes</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.8-pre)</p>
</div>
</body>
</html>
